pc/index.org
#+title: Parsing Combinators in Scheme
#+author: Mayer Goldberg
#+options: creator:nil, toc:1
#+description: This document describes Mayer Goldberg's parsing combinator package, written in Scheme, and the various parsers that were written using it. All the necessary files to run the examples and to write new parsers are made available on this page.
#+keywords: parsing combinators, functional programming, programming languages, lisp, parsing theory, grammars, context-free grammars, CFG, scheme, lambda calculus, Mayer Goldberg, Ben-Gurion University, Department of Computer Science, BGU, BGUCS

* The basic package: [[./files/parsing-combinators.scm][=parsing-combinators.scm=]]

Parsing combinators are a technique for implementing top-down, recursive descent parsers in a way that is functional and compositional. The file =parsing-combinators.scm= implements /parsing combinators/ and a set of supporting procedures for embedding parsers into Scheme. In principle, this is the only file you need to start implementing a parser for your favourite language.

** Basic concepts, and the structure of the parser

A parser is a closure of the form 

#+begin_src scheme
(lambda (s match fail)
  ... )
#+end_src

The argument =s= contains a list of /tokens/. These can be characters or symbols or numbers or any Scheme object. A parser is written in /Continuation-Passing Style/ (CPS), where each parser takes /two/ continuations, =match= and =fail=, corresponding to a standard technique of using /success/ & /fail/ continuations to manage two courses of actions simultaneously. 

The parser will then attempt to construct an /expression/ out of the tokens at the head of the list =s=. If successful, the =match= continuation will be applied to two arguments: the expression & the remaining tokens. If unsuccessful, the =fail= continuation will be applied with no arguments.

When defining the parser, it is possible to specify procedures that do /postprocessing/ on the expression /before/ it is passed to the =match= continuation. If you do not specify a postprocessor, the parser will \ldquo{}do the right thing\rdquo, which in most cases means using the /identity function/ for a postprocessor.

While parsing combinators are implemented in this package using CPS, you do not need to know or use CPS in order to use this package. Part of the beauty of parsing combinators is that they /compose/ parsers (and are themselves written in CPS), but the expressions the expressions that combine parsing combinators are themselves written in /direct style/, i.e., do not themselves use CPS.

** How parsing combinators are used to construct parsers

Parsing combinators are higher-order functions that compose parsers for smaller languages into parsers for larger languages. The idea is to start with /constant/ parsers, that recognize single tokens, and then combine them using /catenation/, /disjunction/ and the /Kleene Star/ into larger parsers. 

For example, the parser for recognizing the string "=fubar=" is defined as a catenation of the parsers that recognize the individual characters =#\f=, =#\u=, =#\b=, =#\a=, & =#\r=. 

Accordingly, the procedures that form the basis for the parsing combinator package are =const= -- for defining /constants/, =caten= -- for returning the /catenation/ parsers, =disj= -- for returning the /disjunction/ of parsers, and =star= -- for returning the /Kleene Star/ of a given parser. 

** The main entry points

*** =test=

The procedure =test= is provided so as to simplify testing and debugging of parsers that were written using parsing combinators. It takes 2 arguments:
1. A parser
2. A list of tokens
It returns a \ldquo{}report\rdquo, which means either the symbol =no-match!=, in case the parser was not able to construct an expression from the first tokens in the list of tokens, or a list that details the expression the parser had generated and the remaining tokens.

The procedure =test= is not meant as a delivery vehicle for the parser, but rather just for testing. Examples of how =test= is used will appear throughout this page.

*** =const=

The =const= procedure is how parsers are defined that recognize the simplest expressions -- usually at the level of individual characters. For the sake of generality, =const= takes a /predicate/ =match?= and an optional postprocessor =cb=. If the list of tokens is non-empty & its head satisfies =match?=, then the head is passed on to the postprocessor, and whatever is returned by the postprocessor is passed onto the /success continuation/ =match=, along with the remainder of the list of tokens. If the list of tokens is empty, or =match?= is not satisfied, then the /fail continuation/ =fail= is called.

Here are some examples:

The parser =p1= recognizes the number 37 (how boring is that??). We first call it with a list that does /not/ start with =37=, and then with a list that does:

#+begin_src scheme
> (define p1 (const (lambda (x) (and (number? x) (= x 37)))))
> (test p1 '(1 2))
no-match!
> (test p1 '(37 1 2))
((expression: 37) (tokens left: (1 2)))
#+end_src

The parser =p2= also recognizes the number 37. It is different from =p1= in that we provide a postprocessor that takes the argument =37= and replaces with it with the symbol =thirty-seven=. The difference in the behaviour of =p2= should be clear:

#+begin_src scheme
> (define p2 (const (lambda (x) (and (number? x) (= x 37))) (lambda (_) 'thirty-seven)))
> (test p2 '(1 2))
no-match!
 > (test p2 '(37 1 2))
((expression: thirty-seven) (tokens left: (1 2)))
#+end_src

