pc/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Parsing Combinators in Scheme</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="Parsing Combinators in Scheme"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-06-06T22:53+0300"/>
<meta name="author" content="Mayer Goldberg"/>
<meta name="description" content="This document describes Mayer Goldberg's parsing combinator package, written in Scheme, and the various parsers that were written using it. All the necessary files to run the examples and to write new parsers are made available on this page."/>
<meta name="keywords" content="parsing combinators, functional programming, programming languages, lisp, parsing theory, grammars, context-free grammars, CFG, scheme, lambda calculus, Mayer Goldberg, Ben-Gurion University, Department of Computer Science, BGU, BGUCS"/>
</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Parsing Combinators in Scheme</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 The basic package: <code>parsing-combinators.scm</code></a></li>
<li><a href="#sec-2">2 A scanner &amp; reader for Scheme: <code>parsing-combinators-sexprs.scm</code></a></li>
<li><a href="#sec-3">3 A parser for the &lambda;-calculus: <code>parsing-combinators-lambda.scm</code></a></li>
<li><a href="#sec-4">4 Quo vadis?</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> The basic package: <a href="./files/parsing-combinators.scm"><code>parsing-combinators.scm</code></a></h2>
<div class="outline-text-2" id="text-1">


<p>
Parsing combinators are a technique for implementing top-down, recursive descent parsers in a way that is functional and compositional. The file <code>parsing-combinators.scm</code> implements <i>parsing combinators</i> and a set of supporting procedures for embedding parsers into Scheme. In principle, this is the only file you need to start implementing a parser for your favourite language.
</p>

</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Basic concepts, and the structure of the parser</h3>
<div class="outline-text-3" id="text-1-1">


<p>
A parser is a closure of the form 
</p>



<pre class="example">(lambda (s match fail)
  ... )
</pre>


<p>
The argument <code>s</code> contains a list of <i>tokens</i>. These can be characters or symbols or numbers or any Scheme object. A parser is written in <i>Continuation-Passing Style</i> (CPS), where each parser takes <i>two</i> continuations, <code>match</code> and <code>fail</code>, corresponding to a standard technique of using <i>success</i> &amp; <i>fail</i> continuations to manage two courses of actions simultaneously. 
</p>
<p>
The parser will then attempt to construct an <i>expression</i> out of the tokens at the head of the list <code>s</code>. If successful, the <code>match</code> continuation will be applied to two arguments: the expression &amp; the remaining tokens. If unsuccessful, the <code>fail</code> continuation will be applied with no arguments.
</p>
<p>
When defining the parser, it is possible to specify procedures that do <i>postprocessing</i> on the expression <i>before</i> it is passed to the <code>match</code> continuation. If you do not specify a postprocessor, the parser will &ldquo;do the right thing&rdquo;, which in most cases means using the <i>identity function</i> for a postprocessor.
</p>
<p>
While parsing combinators are implemented in this package using CPS, you do not need to know or use CPS in order to use this package. Part of the beauty of parsing combinators is that they <i>compose</i> parsers (and are themselves written in CPS), but the expressions the expressions that combine parsing combinators are themselves written in <i>direct style</i>, i.e., do not themselves use CPS.
</p>
</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> How parsing combinators are used to construct parsers</h3>
<div class="outline-text-3" id="text-1-2">


<p>
Parsing combinators are higher-order functions that compose parsers for smaller languages into parsers for larger languages. The idea is to start with <i>constant</i> parsers, that recognize single tokens, and then combine them using <i>catenation</i>, <i>disjunction</i> and the <i>Kleene Star</i> into larger parsers. 
</p>
<p>
For example, the parser for recognizing the string "<code>fubar</code>" is defined as a catenation of the parsers that recognize the individual characters <code>#\f</code>, <code>#\u</code>, <code>#\b</code>, <code>#\a</code>, &amp; <code>#\r</code>. 
</p>
<p>
Accordingly, the procedures that form the basis for the parsing combinator package are <code>const</code> &ndash; for defining <i>constants</i>, <code>caten</code> &ndash; for returning the <i>catenation</i> parsers, <code>disj</code> &ndash; for returning the <i>disjunction</i> of parsers, and <code>star</code> &ndash; for returning the <i>Kleene Star</i> of a given parser. 
</p>
</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> The main entry points</h3>
<div class="outline-text-3" id="text-1-3">



</div>

<div id="outline-container-1-3-1" class="outline-4">
<h4 id="sec-1-3-1"><span class="section-number-4">1.3.1</span> <code>test</code></h4>
<div class="outline-text-4" id="text-1-3-1">


<p>
The procedure <code>test</code> is provided so as to simplify testing and debugging of parsers that were written using parsing combinators. It takes 2 arguments:
</p><ol>
<li>A parser
</li>
<li>A list of tokens
</li>
</ol>

<p>It returns a &ldquo;report&rdquo;, which means either the symbol <code>no-match!</code>, in case the parser was not able to construct an expression from the first tokens in the list of tokens, or a list that details the expression the parser had generated and the remaining tokens.
</p>
<p>
The procedure <code>test</code> is not meant as a delivery vehicle for the parser, but rather just for testing. Examples of how <code>test</code> is used will appear throughout this page.
</p>
</div>

</div>

<div id="outline-container-1-3-2" class="outline-4">
<h4 id="sec-1-3-2"><span class="section-number-4">1.3.2</span> <code>const</code></h4>
<div class="outline-text-4" id="text-1-3-2">


<p>
The <code>const</code> procedure is how parsers are defined that recognize the simplest expressions &ndash; usually at the level of individual characters. For the sake of generality, <code>const</code> takes a <i>predicate</i> <code>match?</code> and an optional postprocessor <code>cb</code>. If the list of tokens is non-empty &amp; its head satisfies <code>match?</code>, then the head is passed on to the postprocessor, and whatever is returned by the postprocessor is passed onto the <i>success continuation</i> <code>match</code>, along with the remainder of the list of tokens. If the list of tokens is empty, or <code>match?</code> is not satisfied, then the <i>fail continuation</i> <code>fail</code> is called.
</p>
<p>
Here are some examples:
</p>
<p>
The parser <code>p1</code> recognizes the number 37 (how boring is that??). We first call it with a list that does <i>not</i> start with <code>37</code>, and then with a list that does:
</p>



<pre class="example">&gt; (define p1 (const (lambda (x) (and (number? x) (= x 37)))))
&gt; (test p1 '(1 2))
no-match!
&gt; (test p1 '(37 1 2))
((expression: 37) (tokens left: (1 2)))
</pre>


<p>
The parser <code>p2</code> also recognizes the number 37. It is different from <code>p1</code> in that we provide a postprocessor that takes the argument <code>37</code> and replaces with it with the symbol <code>thirty-seven</code>. The difference in the behaviour of <code>p2</code> should be clear:
</p>



<pre class="example">&gt; (define p2 (const (lambda (x) (and (number? x) (= x 37))) (lambda (_) 'thirty-seven)))
&gt; (test p2 '(1 2))
no-match!
 &gt; (test p2 '(37 1 2))
((expression: thirty-seven) (tokens left: (1 2)))
</pre>


</div>

</div>
