pc/index.org
*** =caten=

$$\mathtt{caten}(\mathit{parser}_{G_1}, \ldots, \mathit{parser}_{G_n}) =
 \mathit{parser}_{(G_1 \cdots G_n)} $$

The =caten= procedure takes any number of parsers as arguments (it is a /variadic/ procedure), and returns their catenation. For example, if =p1= recognizes the number 1, =p2= recognizes the number 2, & =p3= recognizes the number 3, then the catenation of =p1=, =p2=, & =p3= is a parser that recognizes the numbers 1 2 3, in order, in the start of the list of tokens.

#+begin_src scheme
> (define number
    (lambda (n)
      (const
       (lambda (x)
         (and (number? x)
              (= x n))))))
> (define p4 ((caten (number 1) (number 2) (number 3))))
> (test p4 '(3 2 1 4))
no-match!
> (test p4 '(1 2 3 4))
((expression: (1 2 3)) (tokens left: (4)))
#+end_src

Notice that in the above example, =caten= has two pairs of parenthesis around it, that it, the application of =caten= returns a /closure/ that is applied again. Because =caten= takes /any number/ of parsers as arguments, and because we wish to be able to specify an additional, optional postprocessor, the simplest solution is to define =caten= as two nested, variadic procedures: The outermost is applied to the parsers, and returns a variadic closure that can be applied to the optional argument -- the postprocessor. In the above example, we did not pass any postprocessor, which is why the second variadic closure was applied without any arguments.

The postprocessor that is used by =caten= is different from all other postprocessor procedures that are used in this package: All other postprocessors take but one single argument. The postprocessor used by =caten= takes as many arguments as were concatenated. Here is an example:

#+begin_src scheme
> (define p5 
    ((caten (number 1) (number 2) (number 3))
     (lambda (a b c)
       `(the tokens begin with ,a ,b and ,c))))
> (test p5 '(hi mom!))
no-match!
> (test p5 '(1 2 3 hi mom!))
((expression: (the tokens begin with 1 2 and 3))
  (tokens left: (hi mom!)))
#+end_src

The motivation behind making =conj= be variadic, as opposed to binary, is not merely to avoid gratuitous nesting & parenthesis: In the algebra of parsing combinators, the /empty conjuction/, i.e., the conjuction of zero parsers, is the \epsilon-parser, i.e., the parser that recognizes \epsilon (/epsilon/). This parser does not shorten the list of tokens, and matches the empty list =()=. So the variadic catenation is both convenient and theoretically-sound, and saves us from having to define yet-another global entry point -- the \epsilon-parser (which is used in defining the =star= procedure).

*** =disj=

$$\mathtt{disj}(\mathit{parser}_{G_1}, \ldots, \mathit{parser}_{G_n}) =
 \mathit{parser}_{(G_1 \mid \cdots \mid G_n)} $$

The =disj= procedure takes any number of parsers as arguments, and returns their disjunction. Starting with the first parser, it attempts to construct an expression out of the list of incoming tokens. If it succeeds, the parser passed the expression and remaining tokens to the /success continuation/ =match=; If it fails, it moves on to the next parser. If none of the parsers match an initial sublist of the incoming tokens, then the /fail continuation/ =fail= is applied. The empty disjunction, i.e., the disjunction of zero parsers, is the parser that invokes the /fail continuation/ for any incoming list of tokens.

As with =caten=, the procedure =disj= is a variadic closure that is applied to any number of parsers, and returns a variadic closure that is applied to an optional postprocessor.

Consider the following examples:

#+begin_src scheme
> (define p6 ((disj (number 3) (number 5) (number 8))))
> (test p6 '())
no-match!
> (test p6 '(2 3 4 5))
no-match!
> (test p6 '(3 4))
((expression: 3) (tokens left: (4)))
> (test p6 '(5 6))
((expression: 5) (tokens left: (6)))
> (test p6 '(8 8 8))
((expression: 8) (tokens left: (8 8)))
#+end_src

*** =star=

$$\mathtt{star}(\mathit{parser}_G) = \mathit{parser}_{(G^{*})} $$

The =star= procedure takes a parser =p= and an optional postprocessor =cb=, and returns a parser for the grammar that matches lists of zero or more strings matched by =p=. The resulting list is then passed to the postprocessor, and the return value of the postprocessor, together with the remaining sublist of tokens, is passed to the /success continuation/ =match=. The parser =(star p)= always matches some, possibly empty, list, even if =p= matches nothing.
Consider the following examples:

#+begin_src scheme
> (define p7 (star (number 23)))
> (test p7 '(2 3 4 5))
((expression: ()) (tokens left: (2 3 4 5)))
> (test p7 '(23 23 23 23 4 5 6))
((expression: (23 23 23 23)) (tokens left: (4 5 6)))
> (define p8 
    (star 
     (const 
      (lambda (ch) 
        (not (and (char-ci<=? #\a ch)
                  (char-ci<=? ch #\z)))))
     ;; pack the punctuation chars:
     (lambda (s) `(punctuation ,(list->string s)))))
> (test p8 (string->list "[1] an item..."))
((expression: (punctuation "[1] "))
  (tokens
    left:
    (#\a #\n #\space #\i #\t #\e #\m #\. #\. #\.)))
#+end_src

*** =maybe=

$$\mathtt{maybe}(\mathit{parser}_G) = \mathit{parser}_{(G^{?})}
  = \mathit{parser}_{(\epsilon \mid G)} $$

The =maybe= procedures takes a parser =p= and an optional postprocessor =cb=, and returns a parser for the grammar that matches either zero or one expressions that are matched by =p=. It is not the argument that is passed onto the postprocessor, but rather /a list containing the argument./ If no argument is matched, the postprocessor is passed the empty list. It is therefore possible to test for whether there was zero or one arguments simply by testing for =null?=. Consider the following examples:

#+begin_src scheme
> (define p8 (maybe (number 23)))
> (test p8 '())
((expression: ()) (tokens left: ()))
> (test p8 '(2 3 4 5))
((expression: ()) (tokens left: (2 3 4 5)))
> (test p8 '(23 4 5))
((expression: (23)) (tokens left: (4 5)))
> (define p9 (maybe (const null?)))
> (test p9 '())
((expression: ()) (tokens left: ()))
> (test p9 '(()))
((expression: (())) (tokens left: ()))
> (test p9 '(() () ()))
((expression: (())) (tokens left: (() ())))
#+end_src

** Building extensions



