pc/index.html

<div id="outline-container-1-3-3" class="outline-4">
<h4 id="sec-1-3-3"><span class="section-number-4">1.3.3</span> <code>caten</code></h4>
<div class="outline-text-4" id="text-1-3-3">




$$\mathtt{caten}(\mathit{parser}_{G_1}, \ldots, \mathit{parser}_{G_n}) =
 \mathit{parser}_{(G_1 \cdots G_n)} $$

<p>
The <code>caten</code> procedure takes any number of parsers as arguments (it is a <i>variadic</i> procedure), and returns their catenation. For example, if <code>p1</code> recognizes the number 1, <code>p2</code> recognizes the number 2, &amp; <code>p3</code> recognizes the number 3, then the catenation of <code>p1</code>, <code>p2</code>, &amp; <code>p3</code> is a parser that recognizes the numbers 1 2 3, in order, in the start of the list of tokens.
</p>



<pre class="example">&gt; (define number
    (lambda (n)
      (const
       (lambda (x)
         (and (number? x)
              (= x n))))))
&gt; (define p4 ((caten (number 1) (number 2) (number 3))))
&gt; (test p4 '(3 2 1 4))
no-match!
&gt; (test p4 '(1 2 3 4))
((expression: (1 2 3)) (tokens left: (4)))
</pre>


<p>
Notice that in the above example, <code>caten</code> has two pairs of parenthesis around it, that it, the application of <code>caten</code> returns a <i>closure</i> that is applied again. Because <code>caten</code> takes <i>any number</i> of parsers as arguments, and because we wish to be able to specify an additional, optional postprocessor, the simplest solution is to define <code>caten</code> as two nested, variadic procedures: The outermost is applied to the parsers, and returns a variadic closure that can be applied to the optional argument &ndash; the postprocessor. In the above example, we did not pass any postprocessor, which is why the second variadic closure was applied without any arguments.
</p>
<p>
The postprocessor that is used by <code>caten</code> is different from all other postprocessor procedures that are used in this package: All other postprocessors take but one single argument. The postprocessor used by <code>caten</code> takes as many arguments as were concatenated. Here is an example:
</p>



<pre class="example">&gt; (define p5 
    ((caten (number 1) (number 2) (number 3))
     (lambda (a b c)
       `(the tokens begin with ,a ,b and ,c))))
&gt; (test p5 '(hi mom!))
no-match!
&gt; (test p5 '(1 2 3 hi mom!))
((expression: (the tokens begin with 1 2 and 3))
  (tokens left: (hi mom!)))
</pre>


<p>
The motivation behind making <code>conj</code> be variadic, as opposed to binary, is not merely to avoid gratuitous nesting &amp; parenthesis: In the algebra of parsing combinators, the <i>empty conjuction</i>, i.e., the conjuction of zero parsers, is the &epsilon;-parser, i.e., the parser that recognizes &epsilon; (<i>epsilon</i>). This parser does not shorten the list of tokens, and matches the empty list <code>()</code>. So the variadic catenation is both convenient and theoretically-sound, and saves us from having to define yet-another global entry point &ndash; the &epsilon;-parser (which is used in defining the <code>star</code> procedure).
</p>
</div>

</div>

<div id="outline-container-1-3-4" class="outline-4">
<h4 id="sec-1-3-4"><span class="section-number-4">1.3.4</span> <code>disj</code></h4>
<div class="outline-text-4" id="text-1-3-4">




$$\mathtt{disj}(\mathit{parser}_{G_1}, \ldots, \mathit{parser}_{G_n}) =
 \mathit{parser}_{(G_1 \mid \cdots \mid G_n)} $$

<p>
The <code>disj</code> procedure takes any number of parsers as arguments, and returns their disjunction. Starting with the first parser, it attempts to construct an expression out of the list of incoming tokens. If it succeeds, the parser passed the expression and remaining tokens to the <i>success continuation</i> <code>match</code>; If it fails, it moves on to the next parser. If none of the parsers match an initial sublist of the incoming tokens, then the <i>fail continuation</i> <code>fail</code> is applied. The empty disjunction, i.e., the disjunction of zero parsers, is the parser that invokes the <i>fail continuation</i> for any incoming list of tokens.
</p>
<p>
As with <code>caten</code>, the procedure <code>disj</code> is a variadic closure that is applied to any number of parsers, and returns a variadic closure that is applied to an optional postprocessor.
</p>
<p>
Consider the following examples:
</p>



<pre class="example">&gt; (define p6 ((disj (number 3) (number 5) (number 8))))
&gt; (test p6 '())
no-match!
&gt; (test p6 '(2 3 4 5))
no-match!
&gt; (test p6 '(3 4))
((expression: 3) (tokens left: (4)))
&gt; (test p6 '(5 6))
((expression: 5) (tokens left: (6)))
&gt; (test p6 '(8 8 8))
((expression: 8) (tokens left: (8 8)))
</pre>


</div>

</div>

<div id="outline-container-1-3-5" class="outline-4">
<h4 id="sec-1-3-5"><span class="section-number-4">1.3.5</span> <code>star</code></h4>
<div class="outline-text-4" id="text-1-3-5">




$$\mathtt{star}(\mathit{parser}_G) = \mathit{parser}_{(G^{*})} $$

<p>
The <code>star</code> procedure takes a parser <code>p</code> and an optional postprocessor <code>cb</code>, and returns a parser for the grammar that matches lists of zero or more strings matched by <code>p</code>. The resulting list is then passed to the postprocessor, and the return value of the postprocessor, together with the remaining sublist of tokens, is passed to the <i>success continuation</i> <code>match</code>. The parser <code>(star p)</code> always matches some, possibly empty, list, even if <code>p</code> matches nothing.
Consider the following examples:
</p>



<pre class="example">&gt; (define p7 (star (number 23)))
&gt; (test p7 '(2 3 4 5))
((expression: ()) (tokens left: (2 3 4 5)))
&gt; (test p7 '(23 23 23 23 4 5 6))
((expression: (23 23 23 23)) (tokens left: (4 5 6)))
&gt; (define p8 
    (star 
     (const 
      (lambda (ch) 
        (not (and (char-ci&lt;=? #\a ch)
                  (char-ci&lt;=? ch #\z)))))
     ;; pack the punctuation chars:
     (lambda (s) `(punctuation ,(list-&gt;string s)))))
&gt; (test p8 (string-&gt;list "[1] an item..."))
((expression: (punctuation "[1] "))
  (tokens
    left:
    (#\a #\n #\space #\i #\t #\e #\m #\. #\. #\.)))
</pre>


</div>

</div>

<div id="outline-container-1-3-6" class="outline-4">
<h4 id="sec-1-3-6"><span class="section-number-4">1.3.6</span> <code>maybe</code></h4>
<div class="outline-text-4" id="text-1-3-6">




$$\mathtt{maybe}(\mathit{parser}_G) = \mathit{parser}_{(G^{?})}
  = \mathit{parser}_{(\epsilon \mid G)} $$

<p>
The <code>maybe</code> procedures takes a parser <code>p</code> and an optional postprocessor <code>cb</code>, and returns a parser for the grammar that matches either zero or one expressions that are matched by <code>p</code>. It is not the argument that is passed onto the postprocessor, but rather <i>a list containing the argument.</i> If no argument is matched, the postprocessor is passed the empty list. It is therefore possible to test for whether there was zero or one arguments simply by testing for <code>null?</code>. Consider the following examples:
</p>



<pre class="example">&gt; (define p8 (maybe (number 23)))
&gt; (test p8 '())
((expression: ()) (tokens left: ()))
&gt; (test p8 '(2 3 4 5))
((expression: ()) (tokens left: (2 3 4 5)))
&gt; (test p8 '(23 4 5))
((expression: (23)) (tokens left: (4 5)))
&gt; (define p9 (maybe (const null?)))
&gt; (test p9 '())
((expression: ()) (tokens left: ()))
&gt; (test p9 '(()))
((expression: (())) (tokens left: ()))
&gt; (test p9 '(() () ()))
((expression: (())) (tokens left: (() ())))
</pre>


</div>
</div>

</div>

<div id="outline-container-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> Building extensions</h3>
<div class="outline-text-3" id="text-1-4">




</div>
</div>

</div>
