pc/index.org
* A scanner & reader for Scheme: [[./files/parsing-combinators-sexprs.scm][=parsing-combinators-sexprs.scm=]]

This file contains an implementation of a /reader/, i.e., a parser for the grammar of [[http://en.wikipedia.org/wiki/S-expression][/S-expressions/]]. Our reader supports some custom extensions to the syntax of S-expression, so as to demonstrate that the grammar we are parsing is really unrelated to the grammar in which the parser is written -- a distinction that is very clear when the implemented language and the language in which the implementation is written are distinct, but which is blurred when the two languages are the same.

Neither do we support the full syntax of S-expressions in Scheme. The main omission is in the [[http://en.wikipedia.org/wiki/Numerical_tower][/numerical tower/]], out of which we only support integers, signed and unsigned, of arbitrary-precisions. It would make for a nice exercise to extend the reader to handle the full numerical tower of Scheme.

** The main entry points

*** =read-sexpr=

The procedure =read-sexpr= is a wrapper around the testing procedure for parsing combinators =test=. It takes a string, expands it to a list of characters, and passes it to =test= with the parser =<sexpr>=. The return value is whatever =test= returns. Here are some examples:

#+begin_src scheme
> (load "parsing-combinators-sexprs.scm")
> (read-sexpr "4")
((expression: 4) (tokens left: ()))
> (read-sexpr "4 5")
((expression: 4) (tokens left: (#\space #\5)))
> (read-sexpr "((a . b) #(() #f #\\A) #;(this sexpr will be removed!))")
((expression: ((a . b) #(() #f #\A))) (tokens left: ()))
#+end_src

Note that since =read-sexpr= takes a string for an argument, some characters cannot be entered without the use of the /backslash/ character (=\=), which is the most commonly-used meta-character for strings. This means that within a string the character object =#\A= must be entered as =#\\A=. String objects within strings must have their matching double quotes prefixed by a backslash.

Because =read-sexpr= uses the =<sexpr>= parser, it attempts to read only one S-expression. Any remaining characters are left un-consumed in the token stream. This single S-expression, however, can be nested arbitrarily, and include subexpressions that are commented out via the S-expression comment prefix =#;=. Here is a more complex example to show that the string can be spread across several lines and include different kinds of comments:

#+begin_src scheme
> (read-sexpr "(;;; This is ignored!
;;; This is another comment line!
first ; this is ignored to the <eoln>!
second #;third
#;(the sexpr comment (can be) (arbitrarily . nested))
)")
((expression: (first second)) (tokens left: ()))
#+end_src

*** =read-sexpr*=

Similarly to =read-sexpr=, the procedure =read-sexpr*= is a wrapper around the testing procedure for parsing combinators =test=

#+begin_src scheme
> (read-sexpr* "1 2 3 5 8 13")
((expression: (1 2 3 5 8 13)) (tokens left: ()))
> (read-sexpr* "() (()) #;((())) ()")
((expression: (() (()) ())) (tokens left: ()))
> (read-sexpr* "\"first string\"\"second string\"")
((expression: ("first string" "second string"))
  (tokens left: ()))
#+end_src

** Extensions to the syntax of S-expressions

The language we are parsing need not be identical to the language in which we are implementing the parser! In fact, this is one pedagogical weakness of meta-circular interpreters -- that they blur the distinction between the implementation language and the language being implemented.

Therefore, we deem it particularly important, for pedagogical purposes, that we implement a language the syntax of which contains various non-standard extensions to Scheme that are not supported by the host system. Exploiting the fact that the current standard now supports Unicode, we extend the syntax of Scheme to include a variety of special characters:

- The Hebrew letter /alef/ (א) is denoted by the named chars =#\alef= & =#\aleph=, and within a string, by the meta-chars =\{alef}= & =\{aleph}=.
- The Hebrew letter /bet/ (ב) is denoted by the named char =#\bet=, and within a string, by the meta-char =\{bet}=.
- The Hebrew letter /gimel/ (ג) is denoted by the named char =#\gimel=, and within a string, by the meta-char =\{gimel}=.
- The smiley character (☺) is denoted by the named char =#\smiley=, and within a string, by the meta-char =\{smiley}=.
- The Tibetan character for the auspicious sound [[http://en.wikipedia.org/wiki/Om][/Om/]] (ༀ) is denoted by the named char =#\tibetan-om=, and within a string, by the meta-char =\{tibetan-om}=.
- The glyph (ﷺ), which stands for the Arabic benediction \rlm{}صلى الله عليه وسلم\lrm{} (meaning /Peace Be Unto Him/) is denoted by the named char =#\pbuh=, and within a string, by the meta-char =\{pbuh}=.

Additionally, we extend both characters and strings to support single-byte octal characters, and single & double-byte hexadecimal characters, so in fact, any Unicode character can be represented:

#+begin_src scheme
> (read-sexpr "(#\\alef #\\tibetan-om . 
                #(\"Peace Be Unto Him: \\{pbuh} \\{smiley}\"))")
((expression: (#\א #\ༀ . #("Peace Be Unto Him: ﷺ ☺")))
  (tokens left: ()))
> (read-sexpr "(#\\x41 #\\x0fc7 #\\o141 \"\\x0f68 \\o041\")")
((expression: (#\A #\࿇ #\a "ཨ !")) (tokens left: ()))
#+end_src

* A parser for the \lambda-calculus: [[./files/parsing-combinators-lambda.scm][=parsing-combinators-lambda.scm=]]

This file contains an implementation of a parser for the \lambda-calculus. The intention of posting it here, in addition to providing another demonstration of using parsing combinators, is to use the parser as a starting point for proramming projects that concern themselves with the \lambda-calculus: Reducers of various kinds, etc. In light of this, I strove to make the syntax as inclusive and as general as possible, allowing for many different ways to encode the same \lambda-expressions.

** Entry points

*** Parser for expressions

The parser for reading in expressions is =<expr>=:

#+begin_src scheme
> (test <expr> (string->list "λa b.(a (mul b) c1)"))
((expression:
   (lambda a
     (lambda b
       (applic
         (applic (var a) (applic (var mul) (var b)))
         (lambda s (var s))))))
  (tokens left: ())) 
#+end_src

The syntax for expressions is rich, and includes automatic Currying, left-associativity for applications, and some syntactic sugar to simplify the encoding of \lambda-expressions. Consult the section on /syntactic sugar/ for additional details.

