pc/index.html

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> A scanner &amp; reader for Scheme: <a href="./files/parsing-combinators-sexprs.scm"><code>parsing-combinators-sexprs.scm</code></a></h2>
<div class="outline-text-2" id="text-2">


<p>
This file contains an implementation of a <i>reader</i>, i.e., a parser for the grammar of <a href="http://en.wikipedia.org/wiki/S-expression"><i>S-expressions</i></a>. Our reader supports some custom extensions to the syntax of S-expression, so as to demonstrate that the grammar we are parsing is really unrelated to the grammar in which the parser is written &ndash; a distinction that is very clear when the implemented language and the language in which the implementation is written are distinct, but which is blurred when the two languages are the same.
</p>
<p>
Neither do we support the full syntax of S-expressions in Scheme. The main omission is in the <a href="http://en.wikipedia.org/wiki/Numerical_tower"><i>numerical tower</i></a>, out of which we only support integers, signed and unsigned, of arbitrary-precisions. It would make for a nice exercise to extend the reader to handle the full numerical tower of Scheme.
</p>

</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> The main entry points</h3>
<div class="outline-text-3" id="text-2-1">



</div>

<div id="outline-container-2-1-1" class="outline-4">
<h4 id="sec-2-1-1"><span class="section-number-4">2.1.1</span> <code>read-sexpr</code></h4>
<div class="outline-text-4" id="text-2-1-1">


<p>
The procedure <code>read-sexpr</code> is a wrapper around the testing procedure for parsing combinators <code>test</code>. It takes a string, expands it to a list of characters, and passes it to <code>test</code> with the parser <code>&lt;sexpr&gt;</code>. The return value is whatever <code>test</code> returns. Here are some examples:
</p>



<pre class="example">&gt; (load "parsing-combinators-sexprs.scm")
&gt; (read-sexpr "4")
((expression: 4) (tokens left: ()))
&gt; (read-sexpr "4 5")
((expression: 4) (tokens left: (#\space #\5)))
&gt; (read-sexpr "((a . b) #(() #f #\\A) #;(this sexpr will be removed!))")
((expression: ((a . b) #(() #f #\A))) (tokens left: ()))
</pre>


<p>
Note that since <code>read-sexpr</code> takes a string for an argument, some characters cannot be entered without the use of the <i>backslash</i> character (<code>\</code>), which is the most commonly-used meta-character for strings. This means that within a string the character object <code>#\A</code> must be entered as <code>#\\A</code>. String objects within strings must have their matching double quotes prefixed by a backslash.
</p>
<p>
Because <code>read-sexpr</code> uses the <code>&lt;sexpr&gt;</code> parser, it attempts to read only one S-expression. Any remaining characters are left un-consumed in the token stream. This single S-expression, however, can be nested arbitrarily, and include subexpressions that are commented out via the S-expression comment prefix <code>#;</code>. Here is a more complex example to show that the string can be spread across several lines and include different kinds of comments:
</p>



<pre class="example">&gt; (read-sexpr "(;;; This is ignored!
;;; This is another comment line!
first ; this is ignored to the &lt;eoln&gt;!
second #;third
#;(the sexpr comment (can be) (arbitrarily . nested))
)")
((expression: (first second)) (tokens left: ()))
</pre>


</div>

</div>

<div id="outline-container-2-1-2" class="outline-4">
<h4 id="sec-2-1-2"><span class="section-number-4">2.1.2</span> <code>read-sexpr*</code></h4>
<div class="outline-text-4" id="text-2-1-2">


<p>
Similarly to <code>read-sexpr</code>, the procedure <code>read-sexpr*</code> is a wrapper around the testing procedure for parsing combinators <code>test</code>
</p>



<pre class="example">&gt; (read-sexpr* "1 2 3 5 8 13")
((expression: (1 2 3 5 8 13)) (tokens left: ()))
&gt; (read-sexpr* "() (()) #;((())) ()")
((expression: (() (()) ())) (tokens left: ()))
&gt; (read-sexpr* "\"first string\"\"second string\"")
((expression: ("first string" "second string"))
  (tokens left: ()))
</pre>


</div>
</div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Extensions to the syntax of S-expressions</h3>
<div class="outline-text-3" id="text-2-2">


<p>
The language we are parsing need not be identical to the language in which we are implementing the parser! In fact, this is one pedagogical weakness of meta-circular interpreters &ndash; that they blur the distinction between the implementation language and the language being implemented.
</p>
<p>
Therefore, we deem it particularly important, for pedagogical purposes, that we implement a language the syntax of which contains various non-standard extensions to Scheme that are not supported by the host system. Exploiting the fact that the current standard now supports Unicode, we extend the syntax of Scheme to include a variety of special characters:
</p>
<ul>
<li>The Hebrew letter <i>alef</i> (א) is denoted by the named chars <code>#\alef</code> &amp; <code>#\aleph</code>, and within a string, by the meta-chars <code>\{alef}</code> &amp; <code>\{aleph}</code>.
</li>
<li>The Hebrew letter <i>bet</i> (ב) is denoted by the named char <code>#\bet</code>, and within a string, by the meta-char <code>\{bet}</code>.
</li>
<li>The Hebrew letter <i>gimel</i> (ג) is denoted by the named char <code>#\gimel</code>, and within a string, by the meta-char <code>\{gimel}</code>.
</li>
<li>The smiley character (☺) is denoted by the named char <code>#\smiley</code>, and within a string, by the meta-char <code>\{smiley}</code>.
</li>
<li>The Tibetan character for the auspicious sound <a href="http://en.wikipedia.org/wiki/Om"><i>Om</i></a> (ༀ) is denoted by the named char <code>#\tibetan-om</code>, and within a string, by the meta-char <code>\{tibetan-om}</code>.
</li>
<li>The glyph (ﷺ), which stands for the Arabic benediction &rlm;صلى الله عليه وسلم&lrm; (meaning <i>Peace Be Unto Him</i>) is denoted by the named char <code>#\pbuh</code>, and within a string, by the meta-char <code>\{pbuh}</code>.
</li>
</ul>


<p>
Additionally, we extend both characters and strings to support single-byte octal characters, and single &amp; double-byte hexadecimal characters, so in fact, any Unicode character can be represented:
</p>



<pre class="example">&gt; (read-sexpr "(#\\alef #\\tibetan-om . 
                #(\"Peace Be Unto Him: \\{pbuh} \\{smiley}\"))")
((expression: (#\א #\ༀ . #("Peace Be Unto Him: ﷺ ☺")))
  (tokens left: ()))
&gt; (read-sexpr "(#\\x41 #\\x0fc7 #\\o141 \"\\x0f68 \\o041\")")
((expression: (#\A #\࿇ #\a "ཨ !")) (tokens left: ()))
</pre>


</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> A parser for the &lambda;-calculus: <a href="./files/parsing-combinators-lambda.scm"><code>parsing-combinators-lambda.scm</code></a></h2>
<div class="outline-text-2" id="text-3">


<p>
This file contains an implementation of a parser for the &lambda;-calculus. The intention of posting it here, in addition to providing another demonstration of using parsing combinators, is to use the parser as a starting point for proramming projects that concern themselves with the &lambda;-calculus: Reducers of various kinds, etc. In light of this, I strove to make the syntax as inclusive and as general as possible, allowing for many different ways to encode the same &lambda;-expressions.
</p>

</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Entry points</h3>
<div class="outline-text-3" id="text-3-1">



</div>

<div id="outline-container-3-1-1" class="outline-4">
<h4 id="sec-3-1-1"><span class="section-number-4">3.1.1</span> Parser for expressions</h4>
<div class="outline-text-4" id="text-3-1-1">


<p>
The parser for reading in expressions is <code>&lt;expr&gt;</code>:
</p>



<pre class="example">&gt; (test &lt;expr&gt; (string-&gt;list "λa b.(a (mul b) c1)"))
((expression:
   (lambda a
     (lambda b
       (applic
         (applic (var a) (applic (var mul) (var b)))
         (lambda s (var s))))))
  (tokens left: ())) 
</pre>


<p>
The syntax for expressions is rich, and includes automatic Currying, left-associativity for applications, and some syntactic sugar to simplify the encoding of &lambda;-expressions. Consult the section on <i>syntactic sugar</i> for additional details.
</p>
</div>

</div>
