pc/index.org
*** parser for definitions

The parser for reading in definitions is =<definition>=:
#+begin_src scheme
> (test <definition> (string->list "K ::= \\x y.x"))
((expression: (define K (lambda x (lambda y (var x)))))
  (tokens left: ()))
> (test <definition> (string->list "B ← \\x y z.(x (y z))"))
((expression:
   (define B
     (lambda x
       (lambda y
         (lambda z (applic (var x) (applic (var y) (var z))))))))
  (tokens left: ()))
> (test <definition> (string->list "K := \\x y.x"))
((expression: (define K (lambda x (lambda y (var x)))))
  (tokens left: ()))
> (test <definition> (string->list "K :: \\x y.x"))
((expression: (define K (lambda x (lambda y (var x)))))
  (tokens left: ()))
> (test <definition> (string->list "K ≣ \\x y.x"))
((expression: (define K (lambda x (lambda y (var x)))))
  (tokens left: ()))
> (test <definition> (string->list "K == \\x y.x"))
((expression: (define K (lambda x (lambda y (var x)))))
  (tokens left: ()))
> (test <definition> (string->list "K <- \\x y.x"))
((expression: (define K (lambda x (lambda y (var x)))))
  (tokens left: ()))
#+end_src

*** Parser for files 

The parser for reading in complete files is =<file>=. It reads any number of definitions, load commands, followed by an optional, single expression:

#+begin_src scheme
> (test <file> (string->list "

s+ ::= L n s z.(s (n s z))
k ::= L x y . x
f ::= L x y . y
i ::= L x . x
[defs.lc]
m ::= λx.(x x)
(m m)
"))
#<procedure >>
> ((expression:
   ((define s+
      (lambda n
        (lambda s
          (lambda z
            (applic
              (var s)
              (applic (applic (var n) (var s)) (var z))))))) (define k (lambda x (lambda y (var x))))
     (define f (lambda x (lambda y (var y))))
     (define i (lambda x (var x))) (load "defs.lc")
     (define m (lambda x (applic (var x) (var x))))
     (applic (var m) (var m))))
  (tokens left: ()))
#+end_src

** Variables

The syntax for variables roughly follows the syntax of symbols in Scheme. A variable can start with lowercase letter, and be followed by digits and certain punctuation characters. Also, some variables that start with punctuation characters are permitted.

Note that some variables are /reserved for syntactic sugar/ and have builtin meaning that cannot be re-defined. Please consult the section on /syntactic sugar/. 

** Abstractions

There are many ways to write abstractions in the \lambda-calculus. We support =lambda=, =lam=, and a capital letter =L=. We also support the backslash (=\=), though it requires a backslash within a string, an ampersand (=&=), and the unicode character \lambda. Please consult the following examples:

#+begin_src scheme
> (test <expr> (string->list "\\ x x"))
((expression: (lambda x (var x))) (tokens left: ()))
> (test <expr> (string->list "\\ x y z.x"))
((expression: (lambda x (lambda y (lambda z (var x)))))
  (tokens left: ()))
> (test <expr> (string->list "\\ x.\\y . x"))
((expression: (lambda x (lambda y (var x))))
  (tokens left: ()))
> (test <expr> (string->list "λ x y z:x"))
((expression: (lambda x (lambda y (lambda z (var x)))))
  (tokens left: ()))
> (test <expr> (string->list "λ x y z.x"))
((expression: (lambda x (lambda y (lambda z (var x)))))
  (tokens left: ()))
> (test <expr> (string->list "Lx y z.x"))
((expression: (lambda x (lambda y (lambda z (var x)))))
  (tokens left: ()))
> (test <expr> (string->list "&x y z.x"))
((expression: (lambda x (lambda y (lambda z (var x)))))
  (tokens left: ()))
> (test <expr> (string->list "lambda x y z.x"))
((expression: (lambda x (lambda y (lambda z (var x)))))
  (tokens left: ()))
> (test <expr> (string->list "lam x y z.x"))
((expression: (lambda x (lambda y (lambda z (var x)))))
  (tokens left: ()))
> (test <expr> (string->list "lambdax y z.x"))
((expression: (lambda x (lambda y (lambda z (var x)))))
  (tokens left: ()))
> (test <expr> (string->list "lamx y z.x"))
((expression: (lambda x (lambda y (lambda z (var x)))))
  (tokens left: ()))
#+end_src

As you can see in the examples, we tried to make spaces optional where possible. The /dot/ is interchangeable with a /colon/. 

** Parenthesized expressions & application

Parentheses are used both for grouping and for delimiting applications. All applications associate to the left:

#+begin_src scheme
> (test <expr> (string->list "(((((x)))))"))
((expression: (var x)) (tokens left: ()))
> (test <expr> (string->list "(a b c d e)"))
((expression:
   (applic
     (applic (applic (applic (var a) (var b)) (var c)) (var d))
     (var e)))
  (tokens left: ()))
> (test <expr> (string->list "(a b c (d e))"))
((expression:
   (applic
     (applic (applic (var a) (var b)) (var c))
     (applic (var d) (var e))))
  (tokens left: ()))
#+end_src

** Syntactic sugar

Texts on the \lambda-calculus employ all sorts of abbreviations and meta-notation. This parser recognizes three:

1. Convenient nation for Church numerals
2. Ordered /n/-tuples
3. Projections

Church numerals & projections can be thought of as referring to special builtin names that have pre-defined values and which cannot be re-defined. Ordered /n/-tuples are a form of syntactic sugar.

*** Church numerals

Church numerals can be written as 

- natural numbers (following Church's /Calculi of Lambda Conversion/),
- =c3=, =church10=, etc
- =c_5=, =church_14=, etc
- =c-1=, =church-18=, etc

They are expanded into the corresponding \lambda-expressions. Note that 
\begin{eqnarray*}
c_1 & = & \lambda sz.sz ~=_{\eta}~ \lambda s.s
\end{eqnarray*}
and accordingly, our parser generates =(lambda s (var s))=.

Natural numbers can either be zero, or else they must start with a non-zero digit.

