pc/index.html

<div id="outline-container-3-1-2" class="outline-4">
<h4 id="sec-3-1-2"><span class="section-number-4">3.1.2</span> parser for definitions</h4>
<div class="outline-text-4" id="text-3-1-2">


<p>
The parser for reading in definitions is <code>&lt;definition&gt;</code>:
</p>


<pre class="example">&gt; (test &lt;definition&gt; (string-&gt;list "K ::= \\x y.x"))
((expression: (define K (lambda x (lambda y (var x)))))
  (tokens left: ()))
&gt; (test &lt;definition&gt; (string-&gt;list "B ← \\x y z.(x (y z))"))
((expression:
   (define B
     (lambda x
       (lambda y
         (lambda z (applic (var x) (applic (var y) (var z))))))))
  (tokens left: ()))
&gt; (test &lt;definition&gt; (string-&gt;list "K := \\x y.x"))
((expression: (define K (lambda x (lambda y (var x)))))
  (tokens left: ()))
&gt; (test &lt;definition&gt; (string-&gt;list "K :: \\x y.x"))
((expression: (define K (lambda x (lambda y (var x)))))
  (tokens left: ()))
&gt; (test &lt;definition&gt; (string-&gt;list "K ≣ \\x y.x"))
((expression: (define K (lambda x (lambda y (var x)))))
  (tokens left: ()))
&gt; (test &lt;definition&gt; (string-&gt;list "K == \\x y.x"))
((expression: (define K (lambda x (lambda y (var x)))))
  (tokens left: ()))
&gt; (test &lt;definition&gt; (string-&gt;list "K &lt;- \\x y.x"))
((expression: (define K (lambda x (lambda y (var x)))))
  (tokens left: ()))
</pre>


</div>

</div>

<div id="outline-container-3-1-3" class="outline-4">
<h4 id="sec-3-1-3"><span class="section-number-4">3.1.3</span> Parser for files</h4>
<div class="outline-text-4" id="text-3-1-3">


<p>
The parser for reading in complete files is <code>&lt;file&gt;</code>. It reads any number of definitions, load commands, followed by an optional, single expression:
</p>



<pre class="example">&gt; (test &lt;file&gt; (string-&gt;list "

s+ ::= L n s z.(s (n s z))
k ::= L x y . x
f ::= L x y . y
i ::= L x . x
[defs.lc]
m ::= λx.(x x)
(m m)
"))
#&lt;procedure &gt;&gt;
&gt; ((expression:
   ((define s+
      (lambda n
        (lambda s
          (lambda z
            (applic
              (var s)
              (applic (applic (var n) (var s)) (var z))))))) (define k (lambda x (lambda y (var x))))
     (define f (lambda x (lambda y (var y))))
     (define i (lambda x (var x))) (load "defs.lc")
     (define m (lambda x (applic (var x) (var x))))
     (applic (var m) (var m))))
  (tokens left: ()))
</pre>


</div>
</div>

</div>

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Variables</h3>
<div class="outline-text-3" id="text-3-2">


<p>
The syntax for variables roughly follows the syntax of symbols in Scheme. A variable can start with lowercase letter, and be followed by digits and certain punctuation characters. Also, some variables that start with punctuation characters are permitted.
</p>
<p>
Note that some variables are <i>reserved for syntactic sugar</i> and have builtin meaning that cannot be re-defined. Please consult the section on <i>syntactic sugar</i>. 
</p>
</div>

</div>

<div id="outline-container-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> Abstractions</h3>
<div class="outline-text-3" id="text-3-3">


<p>
There are many ways to write abstractions in the &lambda;-calculus. We support <code>lambda</code>, <code>lam</code>, and a capital letter <code>L</code>. We also support the backslash (<code>\</code>), though it requires a backslash within a string, an ampersand (<code>&amp;</code>), and the unicode character &lambda;. Please consult the following examples:
</p>



<pre class="example">&gt; (test &lt;expr&gt; (string-&gt;list "\\ x x"))
((expression: (lambda x (var x))) (tokens left: ()))
&gt; (test &lt;expr&gt; (string-&gt;list "\\ x y z.x"))
((expression: (lambda x (lambda y (lambda z (var x)))))
  (tokens left: ()))
&gt; (test &lt;expr&gt; (string-&gt;list "\\ x.\\y . x"))
((expression: (lambda x (lambda y (var x))))
  (tokens left: ()))
&gt; (test &lt;expr&gt; (string-&gt;list "λ x y z:x"))
((expression: (lambda x (lambda y (lambda z (var x)))))
  (tokens left: ()))
&gt; (test &lt;expr&gt; (string-&gt;list "λ x y z.x"))
((expression: (lambda x (lambda y (lambda z (var x)))))
  (tokens left: ()))
&gt; (test &lt;expr&gt; (string-&gt;list "Lx y z.x"))
((expression: (lambda x (lambda y (lambda z (var x)))))
  (tokens left: ()))
&gt; (test &lt;expr&gt; (string-&gt;list "&amp;x y z.x"))
((expression: (lambda x (lambda y (lambda z (var x)))))
  (tokens left: ()))
&gt; (test &lt;expr&gt; (string-&gt;list "lambda x y z.x"))
((expression: (lambda x (lambda y (lambda z (var x)))))
  (tokens left: ()))
&gt; (test &lt;expr&gt; (string-&gt;list "lam x y z.x"))
((expression: (lambda x (lambda y (lambda z (var x)))))
  (tokens left: ()))
&gt; (test &lt;expr&gt; (string-&gt;list "lambdax y z.x"))
((expression: (lambda x (lambda y (lambda z (var x)))))
  (tokens left: ()))
&gt; (test &lt;expr&gt; (string-&gt;list "lamx y z.x"))
((expression: (lambda x (lambda y (lambda z (var x)))))
  (tokens left: ()))
</pre>


<p>
As you can see in the examples, we tried to make spaces optional where possible. The <i>dot</i> is interchangeable with a <i>colon</i>. 
</p>
</div>

</div>

<div id="outline-container-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> Parenthesized expressions &amp; application</h3>
<div class="outline-text-3" id="text-3-4">


<p>
Parentheses are used both for grouping and for delimiting applications. All applications associate to the left:
</p>



<pre class="example">&gt; (test &lt;expr&gt; (string-&gt;list "(((((x)))))"))
((expression: (var x)) (tokens left: ()))
&gt; (test &lt;expr&gt; (string-&gt;list "(a b c d e)"))
((expression:
   (applic
     (applic (applic (applic (var a) (var b)) (var c)) (var d))
     (var e)))
  (tokens left: ()))
&gt; (test &lt;expr&gt; (string-&gt;list "(a b c (d e))"))
((expression:
   (applic
     (applic (applic (var a) (var b)) (var c))
     (applic (var d) (var e))))
  (tokens left: ()))
</pre>


</div>

</div>

<div id="outline-container-3-5" class="outline-3">
<h3 id="sec-3-5"><span class="section-number-3">3.5</span> Syntactic sugar</h3>
<div class="outline-text-3" id="text-3-5">


<p>
Texts on the &lambda;-calculus employ all sorts of abbreviations and meta-notation. This parser recognizes three:
</p>
<ol>
<li>Convenient nation for Church numerals
</li>
<li>Ordered <i>n</i>-tuples
</li>
<li>Projections
</li>
</ol>


<p>
Church numerals &amp; projections can be thought of as referring to special builtin names that have pre-defined values and which cannot be re-defined. Ordered <i>n</i>-tuples are a form of syntactic sugar.
</p>

</div>

<div id="outline-container-3-5-1" class="outline-4">
<h4 id="sec-3-5-1"><span class="section-number-4">3.5.1</span> Church numerals</h4>
<div class="outline-text-4" id="text-3-5-1">


<p>
Church numerals can be written as 
</p>
<ul>
<li>natural numbers (following Church's <i>Calculi of Lambda Conversion</i>),
</li>
<li><code>c3</code>, <code>church10</code>, etc
</li>
<li><code>c_5</code>, <code>church_14</code>, etc
</li>
<li><code>c-1</code>, <code>church-18</code>, etc
</li>
</ul>


<p>
They are expanded into the corresponding &lambda;-expressions. Note that 
\begin{eqnarray*}
c_1 & = & \lambda sz.sz ~=_{\eta}~ \lambda s.s
\end{eqnarray*}
and accordingly, our parser generates <code>(lambda s (var s))</code>.
</p>
<p>
Natural numbers can either be zero, or else they must start with a non-zero digit.
</p>
</div>

</div>
