pc/index.org
*** Ordered /n/-tuples

The parser supports the standard syntax for ordered /n/-tuples, either using square brackets or using angle-brackets:

#+begin_src scheme
> (test <expr> (string->list "<a, b, c>"))
((expression:
   (lambda g0
     (applic
       (applic (applic (var g0) (var a)) (var b))
       (var c))))
  (tokens left: ()))
> (test <expr> (string->list "[a, b, c]"))
((expression:
   (lambda g1
     (applic
       (applic (applic (var g1) (var a)) (var b))
       (var c))))
  (tokens left: ()))
> (test <expr> (string->list "〈a, b, c〉"))
((expression:
   (lambda g2
     (applic
       (applic (applic (var g2) (var a)) (var b))
       (var c))))
  (tokens left: ()))
#+end_src

The standard encoding for the ordered /n/-tuples requires a /fresh variable/, which we create using the =gensym= procedure. It is possible to encode an /n/-tuple without a fresh variable, as an application of the /n/-tuple-maker to the /n/ \lambda-expressions, but while this definition is \beta-equivalent to the standard definition, it is significantly more cumbersome. If the use of =gensym= must be avoided, then you can simply re-define the procedure =^n-tuple= to the more elaborate definition described above.

Note that we support real Unicode angle brackets in addition to the /greater than/ and /less than/ characters that are used to simulate real angle brackets. 

*** Projections

Projections take an ordered /n/-tuple and return the /k/-th tuple. This parser allows for a variety of notation, in accordance with the literature on the \lambda-calculus:

#+begin_src scheme
> (test <expr> (string->list "p12"))
((expression:
   (lambda z
     (applic (var z) (lambda x1 (lambda x2 (var x1))))))
  (tokens left: ()))
> (test <expr> (string->list "p_12"))
((expression:
   (lambda z
     (applic (var z) (lambda x1 (lambda x2 (var x1))))))
  (tokens left: ()))
> (test <expr> (string->list "p_1_2"))
((expression:
   (lambda z
     (applic (var z) (lambda x1 (lambda x2 (var x1))))))
  (tokens left: ()))
> (test <expr> (string->list "proj_1_2"))
((expression:
   (lambda z
     (applic (var z) (lambda x1 (lambda x2 (var x1))))))
  (tokens left: ()))
> (test <expr> (string->list "proj1_2"))
((expression:
   (lambda z
     (applic (var z) (lambda x1 (lambda x2 (var x1))))))
  (tokens left: ()))
> (test <expr> (string->list "π12"))
((expression:
   (lambda z
     (applic (var z) (lambda x1 (lambda x2 (var x1))))))
  (tokens left: ()))
> (test <expr> (string->list "π1_2"))
((expression:
   (lambda z
     (applic (var z) (lambda x1 (lambda x2 (var x1))))))
  (tokens left: ()))
> (test <expr> (string->list "π21"))
((expression:
   (lambda z
     (applic (var z) (lambda x1 (lambda x2 (var x1))))))
  (tokens left: ()))
#+end_src

The last example should make it clear that the order of the /n/ & /k/ is not important, and the parser will interpret this correctly, i.e., take the $\min(n, k)$ index of the tuple out of an ordered $\max(n, k)$. Also, a separator is only needed between /n/ & /k/ when they are longer than 1-digit each. 

** Comments

Because I envisioned this parser as having to support real work, I tried to invest in flexible syntax for comments.

*** Line comments

A line comment start with =;= or =#= and goes on until and /end-of-line/ is encountered. These comments are in the spirit of LISP, Scheme, and various shell & scripting languages of the Unix variety.

*** \lambda-expression comments

Because \lambda-expressions can span several lines, and because comments are often used to disable a definition, or a part of a definition, rather than to document the code, the parser supports comments at the level of entire \lambda-expressions. In the spirit of /S-expr/-comments in Scheme, comments starting with =#;= disable entire \lambda-expressions.

*** XML comments

To comment-out large areas of code, we support the XML tags =<comment> ... </comment>=. Anything in between is commented out. Note, however, that XML comments cannot be nested.

** Loading files

The =<file>= parser supports syntax for specifying the names of files that should be loaded --- presumably files with definitions of various terms. The syntax is diverse:

#+begin_src scheme
> (test <file> (string->list "
(load \"foo-1.lc\")
load [foo-2.lc]
'foo-3.lc'
[foo-4.lc]
\"foo-5.lc\"
"))
((expression:
   ((load "foo-1.lc")
     (load "foo-2.lc")
     (load "foo-3.lc")
     (load "foo-4.lc")
     (load "foo-5.lc")))
  (tokens left: ()))
#+end_src

The rationale for supporting different ways of specifying a filename is that it is inconvenient to use double quotes within strings, because they must be preceeded by a backslash character. So we support the Scheme/LISP/C conventions for strings, as well as the Pascal convention (of using single quotes), as well as a bracket version.

* Quo vadis?


