pc/index.html

<div id="outline-container-3-5-2" class="outline-4">
<h4 id="sec-3-5-2"><span class="section-number-4">3.5.2</span> Ordered <i>n</i>-tuples</h4>
<div class="outline-text-4" id="text-3-5-2">


<p>
The parser supports the standard syntax for ordered <i>n</i>-tuples, either using square brackets or using angle-brackets:
</p>



<pre class="example">&gt; (test &lt;expr&gt; (string-&gt;list "&lt;a, b, c&gt;"))
((expression:
   (lambda g0
     (applic
       (applic (applic (var g0) (var a)) (var b))
       (var c))))
  (tokens left: ()))
&gt; (test &lt;expr&gt; (string-&gt;list "[a, b, c]"))
((expression:
   (lambda g1
     (applic
       (applic (applic (var g1) (var a)) (var b))
       (var c))))
  (tokens left: ()))
&gt; (test &lt;expr&gt; (string-&gt;list "〈a, b, c〉"))
((expression:
   (lambda g2
     (applic
       (applic (applic (var g2) (var a)) (var b))
       (var c))))
  (tokens left: ()))
</pre>


<p>
The standard encoding for the ordered <i>n</i>-tuples requires a <i>fresh variable</i>, which we create using the <code>gensym</code> procedure. It is possible to encode an <i>n</i>-tuple without a fresh variable, as an application of the <i>n</i>-tuple-maker to the <i>n</i> &lambda;-expressions, but while this definition is &beta;-equivalent to the standard definition, it is significantly more cumbersome. If the use of <code>gensym</code> must be avoided, then you can simply re-define the procedure <code>^n-tuple</code> to the more elaborate definition described above.
</p>
<p>
Note that we support real Unicode angle brackets in addition to the <i>greater than</i> and <i>less than</i> characters that are used to simulate real angle brackets. 
</p>
</div>

</div>

<div id="outline-container-3-5-3" class="outline-4">
<h4 id="sec-3-5-3"><span class="section-number-4">3.5.3</span> Projections</h4>
<div class="outline-text-4" id="text-3-5-3">


<p>
Projections take an ordered <i>n</i>-tuple and return the <i>k</i>-th tuple. This parser allows for a variety of notation, in accordance with the literature on the &lambda;-calculus:
</p>



<pre class="example">&gt; (test &lt;expr&gt; (string-&gt;list "p12"))
((expression:
   (lambda z
     (applic (var z) (lambda x1 (lambda x2 (var x1))))))
  (tokens left: ()))
&gt; (test &lt;expr&gt; (string-&gt;list "p_12"))
((expression:
   (lambda z
     (applic (var z) (lambda x1 (lambda x2 (var x1))))))
  (tokens left: ()))
&gt; (test &lt;expr&gt; (string-&gt;list "p_1_2"))
((expression:
   (lambda z
     (applic (var z) (lambda x1 (lambda x2 (var x1))))))
  (tokens left: ()))
&gt; (test &lt;expr&gt; (string-&gt;list "proj_1_2"))
((expression:
   (lambda z
     (applic (var z) (lambda x1 (lambda x2 (var x1))))))
  (tokens left: ()))
&gt; (test &lt;expr&gt; (string-&gt;list "proj1_2"))
((expression:
   (lambda z
     (applic (var z) (lambda x1 (lambda x2 (var x1))))))
  (tokens left: ()))
&gt; (test &lt;expr&gt; (string-&gt;list "π12"))
((expression:
   (lambda z
     (applic (var z) (lambda x1 (lambda x2 (var x1))))))
  (tokens left: ()))
&gt; (test &lt;expr&gt; (string-&gt;list "π1_2"))
((expression:
   (lambda z
     (applic (var z) (lambda x1 (lambda x2 (var x1))))))
  (tokens left: ()))
&gt; (test &lt;expr&gt; (string-&gt;list "π21"))
((expression:
   (lambda z
     (applic (var z) (lambda x1 (lambda x2 (var x1))))))
  (tokens left: ()))
</pre>


<p>
The last example should make it clear that the order of the <i>n</i> &amp; <i>k</i> is not important, and the parser will interpret this correctly, i.e., take the \(\min(n, k)\) index of the tuple out of an ordered \(\max(n, k)\). Also, a separator is only needed between <i>n</i> &amp; <i>k</i> when they are longer than 1-digit each. 
</p>
</div>
</div>

</div>

<div id="outline-container-3-6" class="outline-3">
<h3 id="sec-3-6"><span class="section-number-3">3.6</span> Comments</h3>
<div class="outline-text-3" id="text-3-6">


<p>
Because I envisioned this parser as having to support real work, I tried to invest in flexible syntax for comments.
</p>

</div>

<div id="outline-container-3-6-1" class="outline-4">
<h4 id="sec-3-6-1"><span class="section-number-4">3.6.1</span> Line comments</h4>
<div class="outline-text-4" id="text-3-6-1">


<p>
A line comment start with <code>;</code> or <code>#</code> and goes on until and <i>end-of-line</i> is encountered. These comments are in the spirit of LISP, Scheme, and various shell &amp; scripting languages of the Unix variety.
</p>
</div>

</div>

<div id="outline-container-3-6-2" class="outline-4">
<h4 id="sec-3-6-2"><span class="section-number-4">3.6.2</span> &lambda;-expression comments</h4>
<div class="outline-text-4" id="text-3-6-2">


<p>
Because &lambda;-expressions can span several lines, and because comments are often used to disable a definition, or a part of a definition, rather than to document the code, the parser supports comments at the level of entire &lambda;-expressions. In the spirit of <i>S-expr</i>-comments in Scheme, comments starting with <code>#;</code> disable entire &lambda;-expressions.
</p>
</div>

</div>

<div id="outline-container-3-6-3" class="outline-4">
<h4 id="sec-3-6-3"><span class="section-number-4">3.6.3</span> XML comments</h4>
<div class="outline-text-4" id="text-3-6-3">


<p>
To comment-out large areas of code, we support the XML tags <code>&lt;comment&gt; ... &lt;/comment&gt;</code>. Anything in between is commented out. Note, however, that XML comments cannot be nested.
</p>
</div>
</div>

</div>

<div id="outline-container-3-7" class="outline-3">
<h3 id="sec-3-7"><span class="section-number-3">3.7</span> Loading files</h3>
<div class="outline-text-3" id="text-3-7">


<p>
The <code>&lt;file&gt;</code> parser supports syntax for specifying the names of files that should be loaded &mdash; presumably files with definitions of various terms. The syntax is diverse:
</p>



<pre class="example">&gt; (test &lt;file&gt; (string-&gt;list "
(load \"foo-1.lc\")
load [foo-2.lc]
'foo-3.lc'
[foo-4.lc]
\"foo-5.lc\"
"))
((expression:
   ((load "foo-1.lc")
     (load "foo-2.lc")
     (load "foo-3.lc")
     (load "foo-4.lc")
     (load "foo-5.lc")))
  (tokens left: ()))
</pre>


<p>
The rationale for supporting different ways of specifying a filename is that it is inconvenient to use double quotes within strings, because they must be preceeded by a backslash character. So we support the Scheme/LISP/C conventions for strings, as well as the Pascal convention (of using single quotes), as well as a bracket version.
</p>
</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Quo vadis?</h2>
<div class="outline-text-2" id="text-4">



</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2013-06-06T22:53+0300</p>
<p class="author">Author: Mayer Goldberg</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
